tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.h
#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
typedef struct _ep_tx_opt
{
    uint32_t flags;             /*!< A bitmask of ep_tx_opt_flags */
    uint32_t timestamp;         /*!< Departure timestamp, used if kEP_TX_OPT_START_TIME is set */
    netc_enetc_vlan_tag_t vlan; /*!< VLAN tag which will be inserted, used if kEP_TX_OPT_VLAN_INSERT is set */
} ep_tx_opt;
#else
typedef struct _ep_tx_offload
{
    bool lso;                    /*!< Large send offload. */
    bool l4Checksum;             /*!< L4 checksum offload. */
    bool ipv4Checksum;           /*!< IPv4 checksum offload. */
    uint32_t lsoMaxSegSize : 14; /*!< Large send offload maximum segment size. */
    uint32_t l4Type : 3;         /*!< L4 type. 1-UDP, 2-TCP. */
    uint32_t l3Type : 1;         /*!< L3 type. 0-IPv4, 1-IPv6. */
    uint32_t l3HeaderSize : 7;   /*!< L3 IP header size in units of 32-bit words. */
    uint32_t l3Start : 7;        /*!< Offset of the IPv4/IPv6 header in units of bytes. */
} netc_tx_offload_t;

typedef struct _ep_tx_opt
{
    uint32_t flags;             /*!< A bitmask of ep_tx_opt_flags */
    uint32_t timestamp;         /*!< Departure timestamp, used if kEP_TX_OPT_START_TIME is set */
    netc_enetc_vlan_tag_t vlan; /*!< VLAN tag which will be inserted, used if kEP_TX_OPT_VLAN_INSERT is set */
    netc_tx_offload_t offload;
} ep_tx_opt;
#endif

/*! @} */ // end of netc_ep_xfer
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_xfer
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_datapath
#endif
/*! @addtogroup netc_ep_datapath
 * @{
 */
/*! @brief Port Ingress Filter config */
typedef struct _netc_ep_ipf_config
{
    netc_ipf_config_t dosCfg;          /*!< Configuration for L2/3 DOS. */
    netc_port_ipf_config_t portConfig; /*!< Configuration for port connected to enetc peripheral. */
} netc_ep_ipf_config_t;

/*! @brief PSFP config */
typedef struct _netc_ep_psfp_config
{
    netc_isi_kc_rule_t kcRule[2];
    netc_port_psfp_isi_config isiPortConfig;
} netc_ep_psfp_config_t;

/*! @} */ // end of netc_ep_datapath
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_datapath
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_config
#endif
/*! @addtogroup netc_ep_config
 * @{
 */

/*! @brief Endpoint handle. */
typedef struct _ep_handle ep_handle_t;

/*! @brief Callback for reclaimed tx frames. */
typedef status_t (*ep_reclaim_cb_t)(ep_handle_t *handle, uint8_t ring, netc_tx_frame_info_t *frameInfo, void *userData);

/*! @brief Defines the EP Rx memory buffer alloc function pointer. */
typedef void *(*ep_rx_alloc_cb_t)(ep_handle_t *handle, uint8_t ring, uint32_t length, void *userData);

/*! @brief Defines the EP Rx memory buffer free function pointer. */
typedef void (*ep_rx_free_cb_t)(ep_handle_t *handle, uint8_t ring, void *address, void *userData);

/*! @brief Callback for getting link status */
typedef status_t (*ep_get_link_status_cb_t)(ep_handle_t *handle, uint8_t *link);

/*! @brief Callback for getting link speed */
typedef status_t (*ep_get_link_speed_cb_t)(ep_handle_t *handle,
                                           netc_hw_mii_speed_t *speed,
                                           netc_hw_mii_duplex_t *duplex);

/*! @brief Callback for vsi pre-init */
typedef status_t (*ep_preinit_vsi_cb_t)(netc_enetc_hw_t *hw, netc_hw_si_idx_t si);

/*! @brief Configuration for the endpoint handle. */
typedef struct _ep_config
{
    netc_hw_si_idx_t si;                /*!< Station interface index. */
    netc_hw_enetc_si_config_t siConfig; /*!< Station interface configuration. */
    uint8_t txPrioToTC[8]; /*!< Tx BD ring priority to Tx traffic class queue index mapping, range in TC0 ~ TC7. */
    netc_port_tx_tc_config_t txTcCfg[8]; /*!< Tx traffic class related configuration, vaild only on ENETC 0. */
    netc_ep_psfp_config_t psfpCfg;       /*!< PSFP configuration,cover the ISI key construction profile and port ingress
                                            stream identification configuration. */
    bool enOuterAsInner;                 /*!< Enable use outer VLAN tag as the inner tag if only one tag is found. */
    netc_enetc_native_vlan_config_t rxOuterVLANCfg; /*!< Port outer native VLAN config. */
    netc_enetc_native_vlan_config_t rxInnerVLANCfg; /*!< Port inner native VLAN config. */
    netc_enetc_parser_config_t parserCfg;           /*!< ENETC parser configuration. */
    uint32_t pauseOnThr;  /*!< ENETC Port pause ON threshold value, value 0 means disables pause generation. */
    uint32_t pauseOffThr; /*!< ENETC Port pause OFF threshold value, value 0 means disables pause generation. */
    struct
    {
        netc_port_ethmac_t ethMac; /*!< Ethernet MAC configuration. */
        netc_port_common_t common; /*!< Port common configuration. */
        bool enableTg;             /*!< Enable port time gate scheduling. */
        bool enPseudoMacTxPad; /*!< Enable pseudo MAC Port Transmit Padding, will pad the frame to a minimum of 60 bytes
                                  and append 4 octets of FCS. */
    } port;
    netc_msix_entry_t *msixEntry;       /*!< MSIX table entry array. */
    uint8_t entryNum;                   /*!< MSIX entry number. */
    uint8_t cmdBdEntryIdx;              /*!< MSIX entry index of command BD ring interrupt. */
    uint8_t siComEntryIdx;              /*!< MSIX entry index of PSI-VSI communication interrupt. */
    uint8_t timerSyncEntryIdx;          /*!< MSIX entry index of timer synchronous state change interrupt. */
    ep_reclaim_cb_t reclaimCallback;    /*!< Callback for reclaimed Tx frames. */
    void *userData;                     /*!< User data, return in callback. */
    bool rxCacheMaintain;               /*!< Enable/Disable Rx buffer cache maintain in driver. */
    bool txCacheMaintain;               /*!< Enable/Disable Tx buffer cache maintain in driver. */
    bool rxZeroCopy;                    /*!< Enable/Disable zero-copy receive mode. */
    ep_rx_alloc_cb_t rxBuffAlloc;       /*!< Callback function to alloc memory, must be provided for zero-copy Rx. */
    ep_rx_free_cb_t rxBuffFree;         /*!< Callback function to free memory, must be provided for zero-copy Rx. */
    ep_preinit_vsi_cb_t preinitVsi;     /*!< Callback function to pre-init VSI */
    netc_cmd_bdr_config_t cmdBdrConfig; /*!< Command BD ring configuration. */
} ep_config_t;

/*! @brief Configuration constant in handle. */
typedef struct _ep_config_const
{
    netc_hw_si_idx_t si;    /*!< Station interface index. */
    uint32_t rxRingUse : 7; /*!< Number of Rx Rings to be used, when enable Rx ring group, this equal to the sum of all
                          Rx group rings. */
    uint32_t txRingUse : 7; /*!< Number of Tx Rings to be used, note that when SI is Switch management ENETC SI, the
                          number not include Tx ring 0. */
    uint32_t rxBdrGroupNum : 2;      /*!< Rx BD ring group number, range in 0 ~ 2. */
    uint32_t ringPerBdrGroup : 3;    /*!< The ring number in every Rx BD ring group, range in 1 ~ 8, active when
                                       rxBdrGroupNum not equal zero. */
    bool rxCacheMaintain : 1;        /*!< Enable/Disable Rx buffer cache maintain in driver. */
    bool txCacheMaintain : 1;        /*!< Enable/Disable Tx buffer cache maintain in driver. */
    bool rxZeroCopy : 1;             /*!< Enable/Disable zero-copy receive mode. */
    uint8_t entryNum;                /*!< MSIX entry number. */
    ep_reclaim_cb_t reclaimCallback; /*!< Callback for reclaimed Tx frames. */
    void *userData;                  /*!< User data, return in callback. */
    ep_rx_alloc_cb_t rxBuffAlloc;    /*!< Callback function to alloc memory, must be provided for zero-copy Rx. */
    ep_rx_free_cb_t rxBuffFree;      /*!< Callback function to free memory, must be provided for zero-copy Rx. */
} ep_config_const_t;

/*! @brief Handle for the endpoint
 * Private internal data.
 */
struct _ep_handle
{
    netc_enetc_hw_t hw;                                       /*!< Hardware register map resource. */
    netc_enetc_cap_t capability;                              /*!< ENETC capability. */
    ep_config_const_t cfg;                                    /*!< Endpoint configuration constant. */
    uint8_t ringShift;                                        /*!< Endpoint Tx ring shift. */
    netc_rx_bdr_t rxBdRing[FSL_FEATURE_NETC_SI_RING_NUM_MAX]; /*!< Receive buffer descriptor ring. */
    netc_tx_bdr_t txBdRing[FSL_FEATURE_NETC_SI_RING_NUM_MAX]; /*!< Transmit buffer descriptor ring. */
    netc_cmd_bdr_t cmdBdRing;                                 /*!< Command BD ring handle for endpoint. */
    uint8_t unicastHashCount[64];                             /*!< Unicast hash index collisions counter. */
    uint8_t multicastHashCount[64];                           /*!< Multicast hash index collisions counter. */
    uint8_t vlanHashCount[64];                                /*!< VLAN hash index collisions counter. */
    uint8_t macFilterCount[64];                               /*!< mac address filter index collisions counter. */
    uint8_t vlanFilterCount[64];                              /*!< vlan address filter index collisions counter. */
    ep_get_link_status_cb_t getLinkStatus;                    /*!< Callback to get link status */
    ep_get_link_speed_cb_t getLinkSpeed;                      /*!< Callback to get link speed */
    uint16_t vsiBitMapNotifyLinkStatus;                       /*!< VSI bit map for link status notify */
    uint16_t vsiBitMapNotifyLinkSpeed;                        /*!< VSI bit map for link speed notify */
};

/*! @} */ // end of netc_ep_config
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_config
#endif

#if defined(__cplusplus)
extern "C" {
#endif

