tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.h
/*!
 * @brief Config the TC (traffic class) property
 *
 * @param handle
 * @param tcIdx
 * @param config
 * @return status_t
 */
status_t EP_TxTrafficClassConfig(ep_handle_t *handle, netc_hw_tc_idx_t tcIdx, const netc_port_tx_tc_config_t *config);

/*!
 * @brief Config Preemption for each port TC (traffic class)
 *
 * @param handle
 * @param tcIdx
 * @param enable
 */
static inline void EP_TxTcConfigPreemption(ep_handle_t *handle, netc_hw_tc_idx_t tcIdx, const bool enable)
{
    NETC_PORT_Type *base;

    base = handle->hw.portGroup.port;
    if (!NETC_PortIsPseudo(base))
    {
        NETC_PortConfigTcPreemption(base, tcIdx, enable);
    }
}

/*!
 * @brief Get Preemption configuration for each port TC (traffic class)
 *
 * @param handle
 * @param tcIdx
 * @param enabled
 */
static inline void EP_TxGetTcPreemption(ep_handle_t *handle, netc_hw_tc_idx_t tcIdx, bool *enabled)
{
    NETC_PORT_Type *base;

    base = handle->hw.portGroup.port;
    if (!NETC_PortIsPseudo(base))
    {
        NETC_PortGetTcPreemption(base, tcIdx, enabled);
    }
}

/*!
 * @brief Configure Preemption control configuration for an ethernet MAC
 *
 * @param handle
 * @param config
 */
static inline void EP_TxPortEthMacConfigPreemption(ep_handle_t *handle, const netc_port_preemption_config *config)
{
    NETC_ETH_LINK_Type *base;

    base = handle->hw.portGroup.eth;
    NETC_PortConfigEthMacPreemption(base, config);
}

/*!
 * @brief Get Preemption configuration from ethernet MAC port
 *
 * @param handle
 * @param config
 * @param status
 */
static inline void EP_TxPortGetEthMacPreemption(ep_handle_t *handle,
                                                netc_port_preemption_config *config,
                                                netc_port_phy_mac_preemption_status_t *status)
{
    NETC_ETH_LINK_Type *base;

    base = handle->hw.portGroup.eth;
    NETC_PortGetPhyMacPreemptionControl(base, config);

    NETC_PortGetPhyMacPreemptionStatus(base, status);
}

/*! @} */ // end of netc_ep_tx
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_tx
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_stat
#endif
/*! @addtogroup netc_ep_stat
 * @{
 */

/*!
 * @brief Get the ENETC port discard statistic and reason
 *
 * Get the discarded count of frames and its reasons.
 *
 * @param handle
 * @param useTx true - Tx port.  false - Rx port.
 * @param statistic pointer to the statistic data
 * @return status_t
 */
static inline status_t EP_GetPortDiscardStatistic(ep_handle_t *handle,
                                                  bool useTx,
                                                  netc_port_discard_statistic_t *statistic)
{
    NETC_PortGetDiscardStatistic(handle->hw.portGroup.port, (useTx) ? kNETC_TxDiscard : kNETC_RxDiscard, statistic);
    return kStatus_Success;
}

/*!
 * @brief Clean the EP Port Rx discard reason. Set the related bits to 1 to clear the specific reasons
 *
 * @param handle
 * @param useTx true - Tx port.  false - Rx port.
 * @param reason0
 * @param reason1
 * @return status_t
 */
static inline status_t EP_ClearPortDiscardReason(ep_handle_t *handle, bool useTx, uint32_t reason0, uint32_t reason1)
{
    NETC_PortClearDiscardReason(handle->hw.portGroup.port, (useTx) ? kNETC_TxDiscard : kNETC_RxDiscard, reason0,
                                reason1);
    return kStatus_Success;
}

/*!
 * @brief Get EP port time gate scheduling gate list status
 *
 * @param handle
 * @return Port status flags which are ORed by the enumerators in the @ref netc_port_tgsl_status_t
 */
static inline uint32_t EP_GetPortTGSListStatus(ep_handle_t *handle)
{
    return NETC_PortGetTGSListStatus(handle->hw.portGroup.port);
}

/*! @} */ // end of netc_ep_stat
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_stat
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_interrupt
#endif
/*! @addtogroup netc_ep_interrupt
 * @{
 */

/*!
 * @brief Clean the SI transmit interrupt flags
 *
 * @param handle    The EP handle.
 * @param txFrameIntrMask  IPV value to be mapped, bit x represents ring x.
 * @param txThresIntrMask  The Rx BD ring index to be mapped, bit x represents ring x.
 */
static inline void EP_CleanTxIntrFlags(ep_handle_t *handle, uint16_t txFrameIntrMask, uint16_t txThresIntrMask)
{
    NETC_SICleanTxIntrFlags(handle->hw.si, txFrameIntrMask, txThresIntrMask);
}

/*!
 * @brief Clean the SI receive interrupt flags
 *
 * @param handle    The EP handle.
 * @param rxIntrMask  Rx interrupt bit mask, bit x represents ring x.
 */
static inline void EP_CleanRxIntrFlags(ep_handle_t *handle, uint32_t rxIntrMask)
{
    NETC_SICleanRxIntrFlags(handle->hw.si, rxIntrMask);
}

/*!
 * @brief Set the global MSIX mask status
 *
 * This function masks/unmasks global MSIX message.
 * Mask - All of the vectors are masked, regardless of their per-entry mask bit states.
 * Unmask - Each entry's mask status determines whether the vector is masked or not.
 *
 * @param handle    The EP handle
 * @param mask      The mask state. True: Mask, False: Unmask.
 * @return status_t
 */
status_t EP_MsixSetGlobalMask(ep_handle_t *handle, bool mask);

/*!
 * @brief Set the MSIX entry mask status for specified entry
 *
 * This function masks/unmasks MSIX message for specified entry.
 *
 * @param handle    The EP handle
 * @param entryIdx  The entry index in the table.
 * @param mask      The mask state. True: Mask, False: Unmask.
 * @return status_t
 */
status_t EP_MsixSetEntryMask(ep_handle_t *handle, uint8_t entryIdx, bool mask);

/*!
 * @brief Get the MSIX pending status in MSIX PBA table
 *
 * This function is to get the entry pending status from MSIX PBA table. If interrupt occurs but masked by vector
 * control of entry, pending bit in PBA will be set.
 *
 * @param handle  The EP handle
 * @param pbaIdx  The index of PBA array with 64-bit unit.
 * @param status  Pending status bit mask, bit n for entry n.
 * @return status_t
 */
status_t EP_MsixGetPendingStatus(ep_handle_t *handle, uint8_t pbaIdx, uint64_t *status);

/*! @} */ // end of netc_ep_interrupt
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_interrupt
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_xfer
#endif
/*! @addtogroup netc_ep_xfer
 * @{
 */
/*!
 * @brief Common part for transfer regular frame or Switch management frame.
 * @note This function is internal used. Please use EP_SendFrame() or SWT_SendFrame() API to send frames.
 *
 * @param handle
 * @param txBdRing The Transmit buffer descriptor ring handle
 * @param hwRing The hardware Tx ring index
 * @param frame The frame descriptor pointer
 * @param context Private context provided back by ep_reclaim_cb_t
 * @param txDesc Point to the Transmits BD Description array.
 * @param txCacheMaintain Enable/Disable Tx buffer Cache Maintain.
 * @retval status_t
 */
status_t EP_SendFrameCommon(ep_handle_t *handle,
                            netc_tx_bdr_t *txBdRing,
                            uint8_t hwRing,
                            netc_frame_struct_t *frame,
                            void *context,
                            netc_tx_bd_t *txDesc,
                            bool txCacheMaintain);

/*!
 * @brief Transmits a frame for specified ring.
 * This API is zero-copy and requires the ep_reclaim_cb_t to be called to free the transmitted frame.
 *
 * @param handle
 * @param ring The ring index
 * @param frame The frame descriptor pointer
 * @param context Private context provided back by ep_reclaim_cb_t
 * @param opt Additional tx options. If NULL, default is tx timestamping enabled, no start time and no masquerading.
 * @retval status_t
 */
status_t EP_SendFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, void *context, ep_tx_opt *opt);

/*!
 * @brief Wait until the EP Tx ring has completed the transfer.
 *
 * @note Only call after EP_SendFrame() to do a no-interrupt transfer
 *
 * @param handle
 * @param ring The ring index
 */
static inline void EP_WaitUnitilTxComplete(ep_handle_t *handle, uint8_t ring)
{
    uint8_t hwRing = ring;

