tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.h
#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* Switch management ENETC Tx BD hardware ring 0 can't be used to send regular frame, so the index need increase
         * 1 */
        hwRing += handle->ringShift;
    }
#endif
    while (handle->hw.si->BDR[hwRing].TBCIR != handle->txBdRing[ring].producerIndex)
    {
    }
}
/*!
 * @brief Common part of Reclaim tx descriptors for regular frame or Switch management frame.
 * @note This function is internal used. Please use EP_ReclaimTxDescriptor() or SWT_ReclaimTxDescriptor() API to Reclaim
 * tx descriptors.
 *
 * @param handle
 * @param txBdRing The Transmit buffer descriptor ring handle
 * @param hwRing The hardware Tx ring index
 * @param enCallback Enable/Disable call the Tx Reclaim callback functions.
 */
netc_tx_frame_info_t *EP_ReclaimTxDescCommon(ep_handle_t *handle,
                                             netc_tx_bdr_t *txBdRing,
                                             uint8_t hwRing,
                                             bool enCallback);

/*!
 * @brief Reclaim tx descriptors.
 * This function is used to update the tx descriptor status and
 * get the tx timestamp. For each reclaimed transmit frame the
 * ep_reclaim_cb_t is called.
 *
 * This is called after being notified of a transmit completion from ISR.
 * It runs until there are no more frames to be reclaimed in the BD ring.
 *
 * @param handle
 * @param ring The ring index
 */
void EP_ReclaimTxDescriptor(ep_handle_t *handle, uint8_t ring);

/*!
 * @brief Common part of receives one frame with zero copy from specified ring
 *
 * @note This function is internal used. Please use EP_ReceiveFrame() or SWT_ReceiveFrame() API.
 *
 * @param handle
 * @param rxBdRing Rx BD ring handle
 * @param ring Ring index
 * @param frame Frame buffer point
 * @param attr Frame attribute pointer
 * @param rxCacheMaintain Enable/Disable Rx buffer Cache maintain
 * @return status_t
 */
status_t EP_ReceiveFrameCommon(ep_handle_t *handle,
                               netc_rx_bdr_t *rxBdRing,
                               uint8_t ring,
                               netc_frame_struct_t *frame,
                               netc_frame_attr_t *attr,
                               bool rxCacheMaintain);

/*!
 * @brief Receives one frame with zero copy from specified ring
 *
 * @note The sufficient rx frame data structure MUST be provided by appliction.
 *
 * @param handle
 * @param ring The ring index
 * @param frame The frame descriptor pointer
 * @param attr Frame attribute pointer
 * @return kStatus_Success                Successfully receive a regular frame
 * @return kStatus_NETC_RxHRNotZeroFrame  Frame in Rx BD ring is management frame, need call SWT_ReceiveFrame()
 * @return kStatus_NETC_RxTsrResp         Frame in Rx BD ring is Transmit Timestamp Reference Response messages, need
 *                                        call SWT_GetTimestampRefResp() to get Transmit Timestamp Reference Response
 * @return kStatus_NETC_RxFrameEmpty      Rx BD ring is empty
 * @return kStatus_NETC_RxFrameError      Frame in Rx BD ring has error, need be dropped
 * @return kStatus_InvalidArgument        Rx BD ring index is out of range
 * @return kStatus_NETC_LackOfResource    Appliction provided buffer is not enough
 */
status_t EP_ReceiveFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, netc_frame_attr_t *attr);

/*!
 * @brief Drop one frame
 *
 * @note This function is internal used.
 *
 * @param handle
 * @param rxBdRing Rx BD ring handle
 * @param ring Ring index
 */
void EP_DropFrame(ep_handle_t *handle, netc_rx_bdr_t *rxBdRing, uint8_t ring);

/*!
 * @brief Common part of receive regular frame or Switch management frame which will be copied in the provided buffer
 *
 * @note This function is internal used. Please use EP_ReceiveFrameCopy() or SWT_ReceiveFrameCopy() API.
 *
 * @param handle
 * @param rxBdRing Rx BD ring handle
 * @param ring Ring index
 * @param buffer Buffer address
 * @param length Buffer length
 * @param attr Frame attribute pointer
 * @param rxCacheMaintain Enable/Disable Rx buffer Cache maintain
 * @return status_t
 */
status_t EP_ReceiveFrameCopyCommon(ep_handle_t *handle,
                                   netc_rx_bdr_t *rxBdRing,
                                   uint8_t ring,
                                   void *buffer,
                                   uint32_t length,
                                   netc_frame_attr_t *attr,
                                   bool rxCacheMaintain);

/*!
 * @brief Receives one frame which will be copied in the provided buffer from specified ring
 *
 * @note The buffer size MUST be queried using EP_GetRxFrameSize() beforehand.
 *
 * @param handle
 * @param ring Ring index
 * @param buffer Buffer address
 * @param length Buffer length
 * @param attr Frame attribute pointer
 * @return kStatus_Success                Successfully receive a regular frame
 * @return kStatus_InvalidArgument        Rx BD ring index is out of range
 */
status_t EP_ReceiveFrameCopy(ep_handle_t *handle, uint8_t ring, void *buffer, uint32_t length, netc_frame_attr_t *attr);

/*!
 * @brief Common part of get pending frame size API for regular frame or Switch management frame.
 * @note This function is internal used. Please use EP_GetRxFrameSize() or SWT_GetRxFrameSize() API.
 *
 * @param handle
 * @param rxBdRing Rx BD ring handle
 * @param length The length of the valid frame received.
 * @return status_t
 */
status_t EP_GetRxFrameSizeCommon(ep_handle_t *handle, netc_rx_bdr_t *rxBdRing, uint32_t *length);

/*!
 * @brief Gets the size of the pending frame in the specified receive ring buffer.
 *
 * @note Frame size without FCS
 *
 * @param handle The ENET handler structure. This is the same handler pointer used in the ENET_Init.
 * @param ring The ring index
 * @param length The length of the valid frame received.
 * @return kStatus_Success                Successfully get the length of a regular frame
 * @return kStatus_NETC_RxHRNotZeroFrame  Frame in Rx BD ring is management frame, need call SWT_GetRxFrameSize() to get
 *                                        frame size
 * @return kStatus_NETC_RxTsrResp         Frame in Rx BD ring is Transmit Timestamp Reference Response messages, need
 *                                        call SWT_GetTimestampRefResp() to get Transmit Timestamp Reference Response
 * @return kStatus_NETC_RxFrameEmpty      Rx BD ring is empty
 * @return kStatus_NETC_RxFrameError      Frame in Rx BD ring has error, need be dropped
 * @return kStatus_InvalidArgument        Rx BD ring index is out of range
 */
status_t EP_GetRxFrameSize(ep_handle_t *handle, uint8_t ring, uint32_t *length);

